# **Pandas LAB**

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Get the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [2]:
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"
column_names = ["user_id", "age", "gender", "occupation", "zip_code"]

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [3]:
users_df = pd.read_csv(
                        url,
                        sep='|', 
                        header=None, 
                        names=column_names)
users_df.describe()

       user_id  age gender occupation zip_code
count      944  944    944        944      944
unique     944   62      3         22      796
top        943   30      M    student    55414
freq         1   39    670        196        9

In [4]:
users_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 944 entries, 0 to 943
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     944 non-null    object
 1   age         944 non-null    object
 2   gender      944 non-null    object
 3   occupation  944 non-null    object
 4   zip_code    944 non-null    object
dtypes: object(5)
memory usage: 37.0+ KB

### Step 4. See the first 25 entries

In [5]:
users_df.head(25)

    user_id  age  gender     occupation  zip_code
0   user_id  age  gender     occupation  zip_code
1         1   24       M     technician     85711
2         2   53       F          other     94043
3         3   23       M         writer     32067
4         4   24       M     technician     43537
5         5   33       F          other     15213
6         6   42       M      executive     98101
7         7   57       M  administrator     91344
8         8   36       M  administrator     05201
9         9   29       M        student     01002
10       10   53       M         lawyer     90703
11       11   39       F          other     30329
12       12   28       F          other     06405
13       13   47       M       educator     29206
14       14   45       M      scientist     55106
15       15   49       F       educator     97301
16       16   21       M  entertainment     10309
17       17   30       M     programmer     06355
18       18   35       F          other     37212
19       19   40       M      librarian     02138
20       20   42       F      homemaker     95660
21       21   26       M         writer     30068
22       22   25       M         writer     40206
23       23   30       F         artist     48197
24       24   21       F         artist     94533

### Step 5. See the last 10 entries

In [6]:
users_df.tail(10)

    user_id age gender     occupation zip_code
934     934  61      M       engineer    22902
935     935  42      M         doctor    66221
936     936  24      M          other    32789
937     937  48      M       educator    98072
938     938  38      F     technician    55038
939     939  26      F        student    33319
940     940  32      M  administrator    02215
941     941  20      M        student    97229
942     942  48      F      librarian    78209
943     943  22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [7]:
print(f"Using 'count()': {users_df.count().iloc[0]}")
print(f"Using 'len': {len(users_df)} ")
print(f"Using 'shape': {users_df.shape[0]} ")

Using 'count()': 944
Using 'len': 944
Using 'shape': 944

### Step 7. What is the number of columns in the dataset?

In [8]:
users_df.shape[1]

5

### Step 8. Print the name of all the columns.

In [9]:
users_df.iloc[0]

user_id          user_id
age                  age
gender            gender
occupation    occupation
zip_code        zip_code
Name: 0, dtype: object

### Step 10. What is the data type of each column?

In [10]:
users_df.dtypes

user_id       object
age           object
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. Print only the occupation column

In [11]:
users_df["occupation"]

0         occupation
1         technician
2              other
3             writer
4         technician
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 944, dtype: object

### Step 12. How many different occupations are in this dataset?

In [12]:
occ = users_df["occupation"].unique()

print (f"Uniqe values of occupation: {occ}")
print (f"Their number: {len(occ)}")

Uniqe values of occupation: ['occupation' 'technician' 'other' 'writer' 'executive' 'administrator'
 'student' 'lawyer' 'educator' 'scientist' 'entertainment' 'programmer'
 'librarian' 'homemaker' 'artist' 'engineer' 'marketing' 'none'
 'healthcare' 'retired' 'salesman' 'doctor']
Their number: 22

### Step 13. What is the most frequent occupation?

In [13]:
users_df["occupation"].value_counts()

occupation
student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
salesman          12
lawyer            12
none               9
homemaker          7
doctor             7
occupation         1
Name: count, dtype: int64

In [14]:
users_df["occupation"].value_counts().idxmax()

'student'

### Step 14. Summarize the DataFrame.

In [15]:
users_df.describe()

       user_id  age gender occupation zip_code
count      944  944    944        944      944
unique     944   62      3         22      796
top        943   30      M    student    55414
freq         1   39    670        196        9

## **Group by Operations**

### Count the number of users in each occupation.

In [16]:
users_df["occupation"].value_counts()

occupation
student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
salesman          12
lawyer            12
none               9
homemaker          7
doctor             7
occupation         1
Name: count, dtype: int64

### Calculate the average age of users by gender.

In [17]:
users_df["age"].dtype

dtype('O')

In [18]:
# convert to numeric first
users_df["age"] = pd.to_numeric(users_df["age"], errors="coerce") # from documentation: If 'coerce', then invalid parsing will be set as NaN.

users_df.groupby("gender")["age"].mean()

gender
F         33.813187
M         34.149254
gender          NaN
Name: age, dtype: float64

### Find the minimum, maximum, and average age for each occupation.

In [19]:
users_df.groupby("occupation")["age"].min()

occupation
administrator    21.0
artist           19.0
doctor           28.0
educator         23.0
engineer         22.0
entertainment    15.0
executive        22.0
healthcare       22.0
homemaker        20.0
lawyer           21.0
librarian        23.0
marketing        24.0
none             11.0
occupation        NaN
other            13.0
programmer       20.0
retired          51.0
salesman         18.0
scientist        23.0
student           7.0
technician       21.0
writer           18.0
Name: age, dtype: float64

In [20]:
users_df.groupby("occupation")["age"].max()

occupation
administrator    70.0
artist           48.0
doctor           64.0
educator         63.0
engineer         70.0
entertainment    50.0
executive        69.0
healthcare       62.0
homemaker        50.0
lawyer           53.0
librarian        69.0
marketing        55.0
none             55.0
occupation        NaN
other            64.0
programmer       63.0
retired          73.0
salesman         66.0
scientist        55.0
student          42.0
technician       55.0
writer           60.0
Name: age, dtype: float64

In [21]:
users_df.groupby("occupation")["age"].mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
occupation             NaN
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

## **Filtering**

### Filter the dataset to show only female users.

In [22]:
users_df["gender"].unique()

array(['gender', 'M', 'F'], dtype=object)

In [23]:
users_df[users_df["gender"] == "F" ]

    user_id   age gender  occupation zip_code
2         2  53.0      F       other    94043
5         5  33.0      F       other    15213
11       11  39.0      F       other    30329
12       12  28.0      F       other    06405
15       15  49.0      F    educator    97301
..      ...   ...    ...         ...      ...
925     925  18.0      F    salesman    49036
930     930  28.0      F   scientist    07310
938     938  38.0      F  technician    55038
939     939  26.0      F     student    33319
942     942  48.0      F   librarian    78209

[273 rows x 5 columns]

### Filter the dataset to show users who are either students or educators.

In [24]:
users_df[ (users_df["occupation"] == "student") | (users_df["occupation"] == "educator") ]

    user_id   age gender occupation zip_code
9         9  29.0      M    student    01002
13       13  47.0      M   educator    29206
15       15  49.0      F   educator    97301
30       30   7.0      M    student    55436
32       32  28.0      F    student    78741
..      ...   ...    ...        ...      ...
933     933  28.0      M    student    48105
937     937  48.0      M   educator    98072
939     939  26.0      F    student    33319
941     941  20.0      M    student    97229
943     943  22.0      M    student    77841

[291 rows x 5 columns]

### Filter the dataset to show female users who are in their 20s (20-29).

In [25]:
users_df[ (users_df["gender"] == "F") 
        & ( (20 <= users_df["age"]) & (users_df["age"] < 30) )]

    user_id   age gender     occupation zip_code
12       12  28.0      F          other    06405
24       24  21.0      F         artist    94533
32       32  28.0      F        student    78741
35       35  20.0      F      homemaker    42459
38       38  28.0      F          other    54467
..      ...   ...    ...            ...      ...
917     917  22.0      F        student    20006
921     921  20.0      F        student    98801
922     922  29.0      F  administrator    21114
930     930  28.0      F      scientist    07310
939     939  26.0      F        student    33319

[85 rows x 5 columns]

### Filter the dataset to find users from California (zip codes starting with '9')

In [26]:
users_df[ users_df["zip_code"].str.startswith('9')]

    user_id   age gender     occupation zip_code
2         2  53.0      F          other    94043
6         6  42.0      M      executive    98101
7         7  57.0      M  administrator    91344
10       10  53.0      M         lawyer    90703
15       15  49.0      F       educator    97301
..      ...   ...    ...            ...      ...
902     902  45.0      F         artist    97203
920     920  30.0      F         artist    90008
921     921  20.0      F        student    98801
937     937  48.0      M       educator    98072
941     941  20.0      M        student    97229

[170 rows x 5 columns]

### Create a pivot table showing the count of users by occupation and age decade.

#### age decade: 27 years old --> 20s decade

In [ ]:
users_df[ (users_df["occupation"] == "administrator") 
        & ( (20 <= users_df["age"]) & (users_df["age"] < 30) )]

len ( users_df[ (users_df["occupation"] == "administrator") 
        & ( (20 <= users_df["age"]) & (users_df["age"] < 30) )] )

19